import { solution } from './01-크레인-인형뽑기-게임-gpt';

/**
board                                                            moves                result
[[0,0,0,0,0],[0,0,1,0,3],[0,2,5,0,1],[4,2,4,4,2],[3,5,1,3,1]],   [1,5,3,5,1,2,1,4],   4
 */

describe('250930 / 01-크레인-인형뽑기-게임-gpt', () => {
  it('solution() === 4', () => {
    const result = solution(
      [
        [0, 0, 0, 0, 0],
        [0, 0, 1, 0, 3],
        [0, 2, 5, 0, 1],
        [4, 2, 4, 4, 2],
        [3, 5, 1, 3, 1]
      ], 
      [1, 5, 3, 5, 1, 2, 1, 4]
    );
    expect(result).toBe(4);
  });
});
